DataProcessors/ОщадбанкИРЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ОщадбанкИРЦ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлDBF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>LS</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FIO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TOWN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VUL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BUD</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FLAT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDLICH1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKBEG1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKEND1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDLICH2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKBEG2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKEND2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDLICH3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKBEG3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKEND3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDLICH4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKBEG4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKEND4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDLICH5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKBEG5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>POKEND5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>D_SALDO</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>USLUGA</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SALDO</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>KOD_USLUGA</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>INFO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OKPO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>D_FORM</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЖилойНеЖилойФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЖилойНеЖилойФонд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЖилой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОщадбанкИРЦ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция СуммаПлатежа(ЛС)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК Остаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Авто, , ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Остаток = Выборка.Остаток;
	КонецЦикла;
	Возврат Остаток;
КонецФункции

&НаКлиенте
Процедура ФайлDBFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл XBase (*.dbf)|*.dbf'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "dbf";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    Объект.ФайлDBF = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	//тзЛС = ЛицевыеСчета();
	ЗапросЛС = Новый Запрос;
	ЗапросЛС.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	    |ИЗ
	    |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	    |ГДЕ
	    |	ЛицевыеСчета.ПометкаУдаления = ЛОЖЬ
	    |	И ЛицевыеСчета.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд";
	ЗапросЛС.УстановитьПараметр("НаДату", ТекущаяДата());
	ЗапросЛС.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	РезультатЛС = ЗапросЛС.Выполнить().Выгрузить();
	
	
	тбДляВыгрузки = Новый ТаблицаЗначений;
	тбДляВыгрузки.Колонки.Добавить("LS");
	тбДляВыгрузки.Колонки.Добавить("ID");
	тбДляВыгрузки.Колонки.Добавить("FIO");
	тбДляВыгрузки.Колонки.Добавить("TOWN");
	тбДляВыгрузки.Колонки.Добавить("VUL");
	тбДляВыгрузки.Колонки.Добавить("BUD");
	тбДляВыгрузки.Колонки.Добавить("FLAT");
	тбДляВыгрузки.Колонки.Добавить("IDLICH1");
	тбДляВыгрузки.Колонки.Добавить("POKBEG1");
	тбДляВыгрузки.Колонки.Добавить("POKEND1");
	тбДляВыгрузки.Колонки.Добавить("IDLICH2");
	тбДляВыгрузки.Колонки.Добавить("POKBEG2");
	тбДляВыгрузки.Колонки.Добавить("POKEND2");
	тбДляВыгрузки.Колонки.Добавить("IDLICH3");
	тбДляВыгрузки.Колонки.Добавить("POKBEG3");
	тбДляВыгрузки.Колонки.Добавить("POKEND3");
	тбДляВыгрузки.Колонки.Добавить("IDLICH4");
	тбДляВыгрузки.Колонки.Добавить("POKBEG4");
	тбДляВыгрузки.Колонки.Добавить("POKEND4");
	тбДляВыгрузки.Колонки.Добавить("IDLICH5");
	тбДляВыгрузки.Колонки.Добавить("POKBEG5");
	тбДляВыгрузки.Колонки.Добавить("POKEND5");
	тбДляВыгрузки.Колонки.Добавить("D_SALDO");
	тбДляВыгрузки.Колонки.Добавить("USLUGA");
	тбДляВыгрузки.Колонки.Добавить("SALDO");
	тбДляВыгрузки.Колонки.Добавить("KOD_USLUGA");
	тбДляВыгрузки.Колонки.Добавить("INFO");
	тбДляВыгрузки.Колонки.Добавить("OKPO");
	тбДляВыгрузки.Колонки.Добавить("D_FORM");
	
	
	Для Каждого стрЛС Из РезультатЛС Цикл
		Запрос = Новый Запрос;
		Запрос.Текст =
		   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		   |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Наименование КАК ЛицевойСчет,
		   |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.Наименование КАК ФИО,
		   |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК НомерПрибораУчета,
		   |	ПоказанияПриборовУчетаСрезПоследних.Значение КАК ПоказаниеПрибора,
		   |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги КАК Услуга,
		   |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.Ссылка КАК Ссылка,
		   |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК Остаток,
		   |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		   |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчетОбъект,
		   |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира
		   |ИЗ
		   |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		   |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ОбъектУстановки = &ЛицевойСчет) КАК УстановленныеПриборыУчетаСрезПоследних
		   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
		   |			ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		   |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки
		   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Авто, , ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		   |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет";
		
		Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет", стрЛС.ЛицевойСчет);
		Результат = Запрос.Выполнить().Выгрузить();
		ЛС = ""; 
		Для Каждого стр Из Результат Цикл
			
			Если ЛС <> стр.ЛицевойСчет Тогда
				//НоваяСтрока = тбДляВыгрузки.Добавить();
				НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
			    Адрес = стр.ЛицевойСчетОбъект.Владелец; //УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(стр.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица);
				Представление    = Адрес;//Параметры.Представление;
				НаименованиеВида = Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица.Наименование;//Строка(Параметры.Вид);
				
				спПараметры = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ",");
				НоваяСтрока.LS = стр.ЛицевойСчет;
				НоваяСтрока.FIO = стр.ФИО;//ОбщийМодульМВК.ВыделитьСлово(стр.ФИО);
				Попытка
					Если спПараметры.Количество() = 7 Тогда
					    НоваяСтрока.TOWN = спПараметры[4];
					Иначе
						НоваяСтрока.TOWN = спПараметры[3];
					КонецЕсли;
					НоваяСтрока.VUL = спПараметры[0];
					НоваяСтрока.BUD   = спПараметры[1];
					НоваяСтрока.FLAT = стр.Квартира;   //спПараметры[6];
				Исключение
				КонецПопытки;

				Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
				    НоваяСтрока.IDLICH1 = "-ХВ-" + стр.НомерПрибораУчета;
				ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
					НоваяСтрока.IDLICH1 = "-ГВ-" + стр.НомерПрибораУчета;
				КонецЕсли;
				НоваяСтрока.POKEND1    = стр.ПоказаниеПрибора;
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				    "ВЫБРАТЬ
				    |	ПоказанияПриборовЗаМесяц.ПоказаниеПредыдущее
				    |ИЗ
				    |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
				    |ГДЕ
				    |	ПоказанияПриборовЗаМесяц.Период МЕЖДУ &НачПериода И &КонПериода
				    |	И ПоказанияПриборовЗаМесяц.ПриборУчета = &ПриборУчета";
				Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.Период.ДатаНачала));
				Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.Период.ДатаОкончания));
				Запрос.УстановитьПараметр("ПриборУчета",стр.ПриборУчета); 
				РезультатПоказания = Запрос.Выполнить();
				Выборка = РезультатПоказания.Выбрать();
				Пока Выборка.Следующий() Цикл
					НоваяСтрока.POKBEG1    = Выборка.ПоказаниеПредыдущее;
				КонецЦикла;
				
				НоваяСтрока.D_SALDO = НачалоМесяца(ТекущаяДата());//стр.МесяцНачисления;
				НоваяСтрока.SALDO = стр.Остаток;
				НоваяСтрока.INFO = "Оплата послуг холодного водопостачання та водовідведення";
				НоваяСтрока.OKPO = "03362560";
				НоваяСтрока.D_FORM = НачалоМесяца(ТекущаяДата());
				ЛС = стр.ЛицевойСчет;
			Иначе
				Адрес = стр.ЛицевойСчетОбъект.Владелец;  //УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(стр.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица);
				Представление    = Адрес;//Параметры.Представление;
				НаименованиеВида = Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица.Наименование;//Строка(Параметры.Вид);
				
				спПараметры = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ",");
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.IDLICH2) Тогда
					Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
					    НоваяСтрока.IDLICH2 = "-ХВ-" + стр.НомерПрибораУчета;
					ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
						НоваяСтрока.IDLICH2 = "-ГВ-" + стр.НомерПрибораУчета;
					КонецЕсли;
					НоваяСтрока.POKEND2    = стр.ПоказаниеПрибора;
					
					Запрос = Новый Запрос;
					Запрос.Текст =
					    "ВЫБРАТЬ
					    |	ПоказанияПриборовЗаМесяц.ПоказаниеПредыдущее
					    |ИЗ
					    |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
					    |ГДЕ
					    |	ПоказанияПриборовЗаМесяц.Период МЕЖДУ &НачПериода И &КонПериода";
					Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.Период.ДатаНачала));
					Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.Период.ДатаОкончания));
					РезультатПоказания = Запрос.Выполнить().Выбрать();
					Пока РезультатПоказания.Следующий() Цикл
						НоваяСтрока.POKBEG2    = РезультатПоказания.ПоказаниеПредыдущее;
					КонецЦикла;

				ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.IDLICH3) Тогда
					Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
					    НоваяСтрока.IDLICH3 = "-ХВ-" + стр.НомерПрибораУчета;
					ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
						НоваяСтрока.IDLICH3 = "-ГВ-" + стр.НомерПрибораУчета;
					КонецЕсли;
					НоваяСтрока.POKEND3    = стр.ПоказаниеПрибора;
				    Запрос = Новый Запрос;
					Запрос.Текст =
					    "ВЫБРАТЬ
					    |	ПоказанияПриборовЗаМесяц.ПоказаниеПредыдущее
					    |ИЗ
					    |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
					    |ГДЕ
					    |	ПоказанияПриборовЗаМесяц.Период МЕЖДУ &НачПериода И &КонПериода";
					Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.Период.ДатаНачала));
					Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.Период.ДатаОкончания));
					РезультатПоказания = Запрос.Выполнить().Выбрать();
					Пока РезультатПоказания.Следующий() Цикл
						НоваяСтрока.POKBEG3    = РезультатПоказания.ПоказаниеПредыдущее;
					КонецЦикла;
				ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.IDLICH4) Тогда
					Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
					    НоваяСтрока.IDLICH4 = "-ХВ-" + стр.НомерПрибораУчета;
					ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
						НоваяСтрока.IDLICH4 = "-ГВ-" + стр.НомерПрибораУчета;
					КонецЕсли;
					НоваяСтрока.POKEND4    = стр.ПоказаниеПрибора;
				    Запрос = Новый Запрос;
					Запрос.Текст =
					    "ВЫБРАТЬ
					    |	ПоказанияПриборовЗаМесяц.ПоказаниеПредыдущее
					    |ИЗ
					    |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
					    |ГДЕ
					    |	ПоказанияПриборовЗаМесяц.Период МЕЖДУ &НачПериода И &КонПериода";
					Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.Период.ДатаНачала));
					Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.Период.ДатаОкончания));
					РезультатПоказания = Запрос.Выполнить().Выбрать();
					Пока РезультатПоказания.Следующий() Цикл
						НоваяСтрока.POKBEG4    = РезультатПоказания.ПоказаниеПредыдущее;
					КонецЦикла;
				ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.IDLICH5) Тогда
					Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
					    НоваяСтрока.IDLICH5 = "-ХВ-" + стр.НомерПрибораУчета;
					ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
						НоваяСтрока.IDLICH5 = "-ГВ-" + стр.НомерПрибораУчета;
					КонецЕсли;
					НоваяСтрока.POKEND5    = стр.ПоказаниеПрибора;
				    Запрос = Новый Запрос;
					Запрос.Текст =
					    "ВЫБРАТЬ
					    |	ПоказанияПриборовЗаМесяц.ПоказаниеПредыдущее
					    |ИЗ
					    |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
					    |ГДЕ
					    |	ПоказанияПриборовЗаМесяц.Период МЕЖДУ &НачПериода И &КонПериода";
					Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.Период.ДатаНачала));
					Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.Период.ДатаОкончания));
					РезультатПоказания = Запрос.Выполнить().Выбрать();
					Пока РезультатПоказания.Следующий() Цикл
						НоваяСтрока.POKBEG5    = РезультатПоказания.ПоказаниеПредыдущее;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТаблицу(Команда)
	Файл = Новый XBase;
	Файл.Кодировка = КодировкаXBase.ANSI;
	Файл.поля.Добавить("LS","N",15,0);
	Файл.поля.Добавить("ID","C",7,0);
	Файл.поля.Добавить("FIO","C",50,0);
	Файл.поля.Добавить("TOWN","C",30,0);
	Файл.поля.Добавить("VUL","C",35,0);
	Файл.поля.Добавить("BUD","C",20,0);
	Файл.поля.Добавить("FLAT","C",10,0);
	Файл.поля.Добавить("IDLICH1","C",16,0);
	Файл.поля.Добавить("POKBEG1","N",12,0);
	Файл.поля.Добавить("POKEND1","N",12,0);
	Файл.поля.Добавить("IDLICH2","C",16,0);
	Файл.поля.Добавить("POKBEG2","N",12,0);
	Файл.поля.Добавить("POKEND2","N",12,0);
	Файл.поля.Добавить("IDLICH3","C",16,0);
	Файл.поля.Добавить("POKBEG3","N",12,0);
	Файл.поля.Добавить("POKEND3","N",12,0);
	Файл.поля.Добавить("IDLICH4","C",16,0);
	Файл.поля.Добавить("POKBEG4","N",12,0);
	Файл.поля.Добавить("POKEND4","N",12,0);
	Файл.поля.Добавить("IDLICH5","C",16,0);
	Файл.поля.Добавить("POKBEG5","N",12,0);
	Файл.поля.Добавить("POKEND5","N",12,0);
	Файл.поля.Добавить("D_SALDO","D",8,0);
	Файл.поля.Добавить("SALDO","N",12,2);
	Файл.поля.Добавить("KOD_USLUGA","N",2,0);
	Файл.поля.Добавить("USLUGA","C",35,0);
	Файл.поля.Добавить("INFO","C",150,0);
	Файл.поля.Добавить("OKPO","C",10,0);
	Файл.поля.Добавить("D_FORM","D",8,0);
	
	Попытка
		Файл.СоздатьФайл(Объект.ФайлDBF);
	Исключение
		Предупреждение("Помилка створення файлу " + Файл);
		Возврат;
	КонецПопытки;
	
	Для Каждого стр Из Объект.ТабличнаяЧасть Цикл
		Файл.Добавить();
		Файл.LS      = стр.LS;
		Файл.FIO     = стр.FIO;
		Файл.TOWN    = стр.TOWN;
		Файл.VUL     = стр.VUL;
		Файл.BUD     = стр.BUD;
		Файл.FLAT    = стр.FLAT;
		Файл.IDLICH1 = стр.IDLICH1;
		Файл.POKBEG1 = стр.POKBEG1;
		Файл.POKEND1 = стр.POKEND1;
		Файл.IDLICH2 = стр.IDLICH2;
		Файл.POKBEG2 = стр.POKBEG2;
		Файл.POKEND2 = стр.POKEND2;
		Файл.IDLICH3 = стр.IDLICH3;
		Файл.POKBEG3 = стр.POKBEG3;
		Файл.POKEND3 = стр.POKEND3;
		Файл.IDLICH4 = стр.IDLICH4;
		Файл.POKBEG4 = стр.POKBEG4;
		Файл.POKEND4 = стр.POKEND4;
		Файл.IDLICH5 = стр.IDLICH5;
		Файл.POKBEG5 = стр.POKBEG5;
		Файл.POKEND5 = стр.POKEND5;
		Файл.D_SALDO = стр.D_SALDO;
		Файл.USLUGA  = стр.USLUGA;
		Файл.SALDO   = стр.SALDO;
		Файл.KOD_USLUGA  = стр.KOD_USLUGA;
		Файл.INFO    = стр.INFO;
		Файл.OKPO    = стр.OKPO;
		Файл.D_FORM  = стр.D_FORM;
		Файл.Записать();
	КонецЦикла;
	
	Файл.ЗакрытьФайл();
	Предупреждение("Файл " + Файл + " успішно створений.");
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Функция ЛицевыеСчета()
	Запрос = Новый Запрос;
	Запрос.Текст =
	   "ВЫБРАТЬ
	   |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛС,
	   |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо КАК АдресФИО
	   |ИЗ
	   |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	   |			&НаДату,
	   |			Действует = ИСТИНА
	   |				И Активность = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних
	   |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	   |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет";
	Запрос.УстановитьПараметр("НаДату", Объект.Период.ДатаНачала);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	тзЛС = Новый ТаблицаЗначений;
	тзЛС.Колонки.Добавить("ЛС");
	тзЛС.Колонки.Добавить("АдресФИО");
	Пока Выборка.Следующий() Цикл
		новСтр = тзЛС.Добавить();
		новСтр.ЛС = Выборка.ЛС;
		новСтр.АдресФИО = Выборка.АдресФИО;
	КонецЦикла;
	Возврат тзЛС;
КонецФункции

&НаСервере
Функция ПолучтьАдресДляИнформирования(АдресФИО)
	Адрес = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(АдресФИО, Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица);
	НаименованиеВида = Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица.Наименование;
	спПараметры = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ",");
	_Данные = Новый Структура;
	
	Попытка
		Если спПараметры.Количество() = 7 Тогда
		    _Данные.Вставить("Город", спПараметры[4]);
		Иначе
			_Данные.Вставить("Город", спПараметры[3]);
		КонецЕсли;
		_Данные.Вставить("Улица", спПараметры[2]);
		_Данные.Вставить("Дом",спПараметры[1]);
		_Данные.Вставить("Квартира", спПараметры[0]);
	Исключение
	КонецПопытки;
	Возврат _Данные;
КонецФункции

&НаСервере
Функция ПолучитьПриборыЛС(ЛС)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ПоказаниеПредыдущее,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.Показание,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.Период
	    |ИЗ
	    |	РегистрСведений.ПоказанияПриборовЗаМесяц.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет = &ЛицевойСчет
	    |				И ПриборУчета.Услуга.ВидУслуги = &ВидУслуги) КАК ПоказанияПриборовЗаМесяцСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.ХолоднаяВода);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Приборы = Новый Структура;
	кол = 1;
	Для Каждого стр Из РезультатЗапроса Цикл
		Если кол = 1 Тогда
			Приборы.Вставить("Прибор1", стр.ЗаводскойНомер);
			Приборы.Вставить("ПоказаниеПредыдущее1", стр.ПоказаниеПредыдущее);
			Приборы.Вставить("ПоказаниеТекущее1", стр.Показание);
			кол = кол + 1;
		ИначеЕсли кол = 2 Тогда
			Приборы.Вставить("Прибор2", стр.ЗаводскойНомер);
			Приборы.Вставить("ПоказаниеПредыдущее2", стр.ПоказаниеПредыдущее);
			Приборы.Вставить("ПоказаниеТекущее2", стр.Показание);
			кол = кол + 1;
		ИначеЕсли кол = 3 Тогда
			Приборы.Вставить("Прибор3", стр.ЗаводскойНомер);
			Приборы.Вставить("ПоказаниеПредыдущее3", стр.ПоказаниеПредыдущее);
			Приборы.Вставить("ПоказаниеТекущее3", стр.Показание);
			кол = кол + 1;
		ИначеЕсли кол = 4 Тогда
			Приборы.Вставить("Прибор4", стр.ЗаводскойНомер);
			Приборы.Вставить("ПоказаниеПредыдущее4", стр.ПоказаниеПредыдущее);
			Приборы.Вставить("ПоказаниеТекущее4", стр.Показание);
			кол = кол + 1;
		ИначеЕсли кол = 5 Тогда
			Приборы.Вставить("Прибор5", стр.ЗаводскойНомер);
			Приборы.Вставить("ПоказаниеПредыдущее5", стр.ПоказаниеПредыдущее);
			Приборы.Вставить("ПоказаниеТекущее5", стр.Показание);
			кол = кол + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Приборы;
КонецФункции;
